mcgreg1/ESP_Touch/boards.txt
boards.txt:
##############################################################

guiton.name=ESP32S3 Guiton
guiton.vid.0=0x303a
guiton.pid.0=0x1001

guiton.bootloader.tool=esptool_py
guiton.bootloader.tool.default=esptool_py

guiton.upload.tool=esptool_py
guiton.upload.tool.default=esptool_py
guiton.upload.tool.network=esp_ota

guiton.upload.maximum_size=1310720
guiton.upload.maximum_data_size=327680
guiton.upload.flags=
guiton.upload.extra_flags=
guiton.upload.use_1200bps_touch=false
guiton.upload.wait_for_upload_port=false

guiton.serial.disableDTR=false
guiton.serial.disableRTS=false

guiton.build.tarch=xtensa
guiton.build.bootloader_addr=0x0
guiton.build.target=esp32s3
guiton.build.mcu=esp32s3
guiton.build.core=esp32
guiton.build.variant=esp32s3
guiton.build.board=ESP32S3_DEV

guiton.build.usb_mode=1
guiton.build.cdc_on_boot=0
guiton.build.msc_on_boot=0
guiton.build.dfu_on_boot=0
guiton.build.f_cpu=240000000L
guiton.build.flash_size=4MB
guiton.build.flash_freq=80m
guiton.build.flash_mode=dio
guiton.build.boot=qio
guiton.build.boot_freq=80m
guiton.build.partitions=default
guiton.build.defines=
guiton.build.loop_core=
guiton.build.event_core=
guiton.build.psram_type=qspi
guiton.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
guiton.menu.JTAGAdapter.default=Disabled
guiton.menu.JTAGAdapter.default.build.copy_jtag_files=0
guiton.menu.JTAGAdapter.builtin=Integrated USB JTAG
guiton.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
guiton.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
guiton.menu.JTAGAdapter.external=FTDI Adapter
guiton.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
guiton.menu.JTAGAdapter.external.build.copy_jtag_files=1
guiton.menu.JTAGAdapter.bridge=ESP USB Bridge
guiton.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
guiton.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

guiton.menu.PSRAM.disabled=Disabled
guiton.menu.PSRAM.disabled.build.defines=
guiton.menu.PSRAM.disabled.build.psram_type=qspi
guiton.menu.PSRAM.enabled=QSPI PSRAM
guiton.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
guiton.menu.PSRAM.enabled.build.psram_type=qspi
guiton.menu.PSRAM.opi=OPI PSRAM
guiton.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
guiton.menu.PSRAM.opi.build.psram_type=opi

guiton.menu.FlashMode.qio=QIO 80MHz
guiton.menu.FlashMode.qio.build.flash_mode=dio
guiton.menu.FlashMode.qio.build.boot=qio
guiton.menu.FlashMode.qio.build.boot_freq=80m
guiton.menu.FlashMode.qio.build.flash_freq=80m
guiton.menu.FlashMode.qio120=QIO 120MHz
guiton.menu.FlashMode.qio120.build.flash_mode=dio
guiton.menu.FlashMode.qio120.build.boot=qio
guiton.menu.FlashMode.qio120.build.boot_freq=120m
guiton.menu.FlashMode.qio120.build.flash_freq=80m
guiton.menu.FlashMode.dio=DIO 80MHz
guiton.menu.FlashMode.dio.build.flash_mode=dio
guiton.menu.FlashMode.dio.build.boot=dio
guiton.menu.FlashMode.dio.build.boot_freq=80m
guiton.menu.FlashMode.dio.build.flash_freq=80m
guiton.menu.FlashMode.opi=OPI 80MHz
guiton.menu.FlashMode.opi.build.flash_mode=dout
guiton.menu.FlashMode.opi.build.boot=opi
guiton.menu.FlashMode.opi.build.boot_freq=80m
guiton.menu.FlashMode.opi.build.flash_freq=80m

guiton.menu.FlashSize.4M=4MB (32Mb)
guiton.menu.FlashSize.4M.build.flash_size=4MB
guiton.menu.FlashSize.8M=8MB (64Mb)
guiton.menu.FlashSize.8M.build.flash_size=8MB
guiton.menu.FlashSize.8M.build.partitions=default_8MB
guiton.menu.FlashSize.16M=16MB (128Mb)
guiton.menu.FlashSize.16M.build.flash_size=16MB
#guiton.menu.FlashSize.32M=32MB (256Mb)
#guiton.menu.FlashSize.32M.build.flash_size=32MB

guiton.menu.LoopCore.1=Core 1
guiton.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
guiton.menu.LoopCore.0=Core 0
guiton.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

guiton.menu.EventsCore.1=Core 1
guiton.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
guiton.menu.EventsCore.0=Core 0
guiton.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

guiton.menu.USBMode.hwcdc=Hardware CDC and JTAG
guiton.menu.USBMode.hwcdc.build.usb_mode=1
guiton.menu.USBMode.default=USB-OTG (TinyUSB)
guiton.menu.USBMode.default.build.usb_mode=0

guiton.menu.CDCOnBoot.default=Disabled
guiton.menu.CDCOnBoot.default.build.cdc_on_boot=0
guiton.menu.CDCOnBoot.cdc=Enabled
guiton.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

guiton.menu.MSCOnBoot.default=Disabled
guiton.menu.MSCOnBoot.default.build.msc_on_boot=0
guiton.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
guiton.menu.MSCOnBoot.msc.build.msc_on_boot=1

guiton.menu.DFUOnBoot.default=Disabled
guiton.menu.DFUOnBoot.default.build.dfu_on_boot=0
guiton.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
guiton.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

guiton.menu.UploadMode.default=UART0 / Hardware CDC
guiton.menu.UploadMode.default.upload.use_1200bps_touch=false
guiton.menu.UploadMode.default.upload.wait_for_upload_port=false
guiton.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
guiton.menu.UploadMode.cdc.upload.use_1200bps_touch=true
guiton.menu.UploadMode.cdc.upload.wait_for_upload_port=true

guiton.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
guiton.menu.PartitionScheme.default.build.partitions=default
guiton.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
guiton.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
guiton.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
guiton.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
guiton.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
guiton.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
guiton.menu.PartitionScheme.minimal.build.partitions=minimal
guiton.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
guiton.menu.PartitionScheme.no_ota.build.partitions=no_ota
guiton.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
guiton.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
guiton.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
guiton.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
guiton.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
guiton.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
guiton.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
guiton.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
guiton.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
guiton.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
guiton.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
guiton.menu.PartitionScheme.huge_app.build.partitions=huge_app
guiton.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
guiton.menu.PartitionScheme.max_app=Max APP (8MB)
guiton.menu.PartitionScheme.max_app.build.partitions=max_app_8MB
guiton.menu.PartitionScheme.max_app.upload.maximum_size=8145728
guiton.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
guiton.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
guiton.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
guiton.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
guiton.menu.PartitionScheme.fatflash.build.partitions=ffat
guiton.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
guiton.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
guiton.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
guiton.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
guiton.menu.PartitionScheme.rainmaker=RainMaker
guiton.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
guiton.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

guiton.menu.CPUFreq.240=240MHz (WiFi)
guiton.menu.CPUFreq.240.build.f_cpu=240000000L
guiton.menu.CPUFreq.160=160MHz (WiFi)
guiton.menu.CPUFreq.160.build.f_cpu=160000000L
guiton.menu.CPUFreq.80=80MHz (WiFi)
guiton.menu.CPUFreq.80.build.f_cpu=80000000L
guiton.menu.CPUFreq.40=40MHz
guiton.menu.CPUFreq.40.build.f_cpu=40000000L
guiton.menu.CPUFreq.20=20MHz
guiton.menu.CPUFreq.20.build.f_cpu=20000000L
guiton.menu.CPUFreq.10=10MHz
guiton.menu.CPUFreq.10.build.f_cpu=10000000L

guiton.menu.UploadSpeed.921600=921600
guiton.menu.UploadSpeed.921600.upload.speed=921600
guiton.menu.UploadSpeed.115200=115200
guiton.menu.UploadSpeed.115200.upload.speed=115200
guiton.menu.UploadSpeed.256000.windows=256000
guiton.menu.UploadSpeed.256000.upload.speed=256000
guiton.menu.UploadSpeed.230400.windows.upload.speed=256000
guiton.menu.UploadSpeed.230400=230400
guiton.menu.UploadSpeed.230400.upload.speed=230400
guiton.menu.UploadSpeed.460800.linux=460800
guiton.menu.UploadSpeed.460800.macosx=460800
guiton.menu.UploadSpeed.460800.upload.speed=460800
guiton.menu.UploadSpeed.512000.windows=512000
guiton.menu.UploadSpeed.512000.upload.speed=512000

guiton.menu.DebugLevel.none=None
guiton.menu.DebugLevel.none.build.code_debug=0
guiton.menu.DebugLevel.error=Error
guiton.menu.DebugLevel.error.build.code_debug=1
guiton.menu.DebugLevel.warn=Warn
guiton.menu.DebugLevel.warn.build.code_debug=2
guiton.menu.DebugLevel.info=Info
guiton.menu.DebugLevel.info.build.code_debug=3
guiton.menu.DebugLevel.debug=Debug
guiton.menu.DebugLevel.debug.build.code_debug=4
guiton.menu.DebugLevel.verbose=Verbose
guiton.menu.DebugLevel.verbose.build.code_debug=5

guiton.menu.EraseFlash.none=Disabled
guiton.menu.EraseFlash.none.upload.erase_cmd=
guiton.menu.EraseFlash.all=Enabled
guiton.menu.EraseFlash.all.upload.erase_cmd=-e